Revit 2027 API
BuiltInFailures.MEPCalculationFailures.ClassificationNotSetInFamily Property
 A calculation did not complete because the Classification parameter in the Mechanical Equipment family is not set.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static FailureDefinitionId ClassificationNotSetInFamily { get; }
Public Shared ReadOnly Property ClassificationNotSetInFamily As FailureDefinitionId
	Get
public:
static property FailureDefinitionId^ ClassificationNotSetInFamily {
	FailureDefinitionId^ get ();
}
static member ClassificationNotSetInFamily : FailureDefinitionId with get
Property Value
FailureDefinitionId
See Also
Reference
BuiltInFailures.MEPCalculationFailures Class
Autodesk.Revit.DB Namespace